biergarten-api/app/serializers/beer_serializer.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."beer_id" = $1  [["beer_id", 1]]
---
  def reviews
    self.object.reviews.map do |review|

SELECT "favorites".* FROM "favorites" WHERE "favorites"."beer_id" = $1  [["beer_id", 1]]
---
  def favorites
    self.object.favorites.map do |favorite|