biergarten-api/app/controllers/api/v1/beers_controller.rb

    def index
      beers = Beer.all
---
SELECT "beers".* FROM "beers"